# pragma once
//# define NO_S3D_USING
# include <Siv3D.hpp>

//========================================
// 定義
//========================================
#include "defines.h"

//========================================
// ベースクラス
//========================================
#include "GameObject.h"
#include "IComponent.h"

//========================================
// コンポーネント
//========================================
#include "Transform2D.h"

//========================================
// 弾丸ベースコンポーネント
//========================================
#include "SimpleBullet.h"
#include "InvoluteBullet.h"
